package golang_leetcode

import (
	"fmt"
	"testing"
)

/*
问题如下图所示的迷宫共有9个格子，相邻格子有门相通，9号格子就是迷宫出口. 整个迷宫将会在5分钟后坍塌. 1号格子有一只老鼠，这只老鼠以每分钟一格的速度在迷宫里乱窜（它通过各扇门的机会均等）。求此老鼠在迷宫坍塌之前逃生的概率。如果这只老鼠速度提高一倍，则老鼠在迷宫坍塌之前逃生的概率能增加多少？

|----------------|
|    |     |     |
|  1    2     3  |
|    |     |     |
|-  ---  -----  -|
|    |     |     |
| 4    5     6   |
|    |     |     |
|-  ---  -----  -|
|    |     |     |
|  7    8    9   |
|    |     |     |
|----------------|

*/

func TestMouseEscape(t *testing.T) {
	n := 10
	result := [][]float64{
		{1.0, 0.0, 0.0},
		{0.0, 0.0, 0.0},
		{0.0, 0.0, 0.0},
	}  // 初始
	for i:=0; i<n; i++ {
		//v = []float64{0.5 * v[1] + 0.5 * v[2], 0.5 * v[0], 0.5 * v[0], 0.5 * v[1] + 0.5 * v[2] + v[3]}
		result = [][]float64{
			{result[0][1]*1/3 + result[1][0]*1/3, result[0][0]*0.5 + result[0][2]*0.5 + result[1][1]*0.25, result[0][1]*1/3 + result[1][2]*1/3},
			{result[0][0]*0.5 + result[1][1]*0.25 + result[2][0]*0.5, result[0][1]*1/3 + result[1][0]*1/3 + result[1][2]*1/3 + result[2][1]*1/3, result[0][2]*0.5 + result[1][1]*0.25},
			{result[1][0]*1/3 + result[2][1]*1/3, result[2][0]*0.5 + result[1][1]*0.25, result[2][1]*1/3 + result[1][2]*1/3 + result[2][2]},
		}
		fmt.Println(result)
	}
}